package com.bishe.nongcun.utils;

/**
 * Developer : xiongwenwei@aliyun.com
 * Create Time :2016-6-16 15:32:08
 * Function：全国省市县Json数据
 */
public class CityData {

    public static String getJson() {
        String s = "{\"note\":\"全国省市县数据\",\"data\":[" +
                "{\"name\":\"水果\",\"city\":[" +
                "{\"name\":\"香蕉\",\"county\":[\"粉蕉\",\"台湾旗山蕉\",\"巴西香蕉\",\"仙人蕉\",\"香蕉\"]}," +
                "{\"name\":\"西瓜\",\"county\":[\"花皮无籽\",\"地雷瓜\",\"8424西瓜\",\"冠龙\",\"西瓜\"]}," +
                "{\"name\":\"甜瓜\",\"county\":[\"脆宝\",\"早雪\",\"花蕾\",\"陕甜\",\"白雪\"]}," +
                "{\"name\":\"梨\",\"county\":[\"酥梨\",\"雪花梨\",\"长巴梨\",\"皇冠梨\",\"苹果梨\"]}," +
                "{\"name\":\"甘蔗\",\"county\":[\"大灰种\",\"黑皮甘蔗\",\"糖蔗\",\"黄皮甘蔗\",\"香蕉\"]}," +
                "{\"name\":\"毛桃\",\"county\":[\"黄桃\",\"秦王桃\",\"蟠桃\",\"蜜桃\",\"毛桃\"]}," +
                "{\"name\":\"菠萝\",\"county\":[\"菠萝\",\"台湾旗山蕉\",\"巴西香蕉\",\"仙人蕉\",\"香蕉\"]}," +
                "{\"name\":\"苹果\",\"county\":[\"红富士\",\"秦冠\",\"红星\",\"青苹果\",\"黄元帅\",\"国光\",\"红玉\",\"苹果\"]}]}," +
                "{\"name\":\"水果\",\"city\":[" +
                "{\"name\":\"香蕉\",\"county\":[\"粉蕉\",\"台湾旗山蕉\",\"巴西香蕉\",\"仙人蕉\",\"香蕉\"]}," +
                "{\"name\":\"西瓜\",\"county\":[\"花皮无籽\",\"地雷瓜\",\"8424西瓜\",\"冠龙\",\"西瓜\"]}," +
                "{\"name\":\"甜瓜\",\"county\":[\"脆宝\",\"早雪\",\"花蕾\",\"陕甜\",\"白雪\"]}," +
                "{\"name\":\"梨\",\"county\":[\"酥梨\",\"雪花梨\",\"长巴梨\",\"皇冠梨\",\"苹果梨\"]}," +
                "{\"name\":\"甘蔗\",\"county\":[\"大灰种\",\"黑皮甘蔗\",\"糖蔗\",\"黄皮甘蔗\",\"香蕉\"]}," +
                "{\"name\":\"毛桃\",\"county\":[\"黄桃\",\"秦王桃\",\"蟠桃\",\"蜜桃\",\"毛桃\"]}," +
                "{\"name\":\"菠萝\",\"county\":[\"菠萝\",\"台湾旗山蕉\",\"巴西香蕉\",\"仙人蕉\",\"香蕉\"]}," +
                "{\"name\":\"苹果\",\"county\":[\"红富士\",\"秦冠\",\"红星\",\"青苹果\",\"黄元帅\",\"国光\",\"红玉\",\"苹果\"]}]}," +
                "{\"name\":\"粮油\",\"city\":" +
                "[{\"name\":\"玉米\",\"county\":[\"吉祥一号\",\"先玉335\",\"甜玉米\",\"糯玉米\",\"玉米\",\"江干\",\"临安\",\"上城\",\"桐庐\",\"西湖\",\"下城\",\"萧山\",\"余杭\"]}," +
                "{\"name\":\"小麦\",\"county\":[\"啤麦\",\"永良\",\"冬小麦\",\"其他小麦\"]}," +
                "{\"name\":\"稻米\",\"county\":[\"威优46\",\"0538大米\",\"稻糠\",\"油糠\"]}]}" +

                "]}";
        return s;
    }
}
