package com.bishe.nongcun.utils;

/**
 * Developer : xiongwenwei@aliyun.com
 * Create Time :2016-6-16 15:32:08
 * Function：全国省市县Json数据
 */
public class CityData {

    public static String getJson() {
        String s = "{'note':'全国省市县数据','data':[" +

                "{'name':'庭院菜','city':[" +
                "{'name':'白菜','county':['秋宝白菜','夏阳','胶州大白菜','青杂三号','白菜']}," +
                "{'name':'萝卜','county':['三红萝卜','白皮白萝卜','红萝卜','心里美萝卜','萝卜']}," +
                "{'name':'豆角','county':['毛豆角','绿龙豆角','豌豆','千千柳-','豆角']}," +
                "{'name':'黄瓜','county':['中农106','双丰黄瓜','碧玉黄瓜','早青2号','黄瓜']}," +
                "{'name':'土豆','county':['黑金刚土豆','大西洋','中薯系列','荷兰十五','土豆']}," +
                "{'name':'西红柿','county':['祥瑞','粉白利','樱桃西红柿','夏宝','欧盾','黑番茄','粉多纳','西红柿']}" +
                "]}," +

                "{'name':'大棚菜','city':[" +
                "{'name':'白菜','county':['秋宝白菜','夏阳','胶州大白菜','青杂三号','白菜']}," +
                "{'name':'萝卜','county':['三红萝卜','白皮白萝卜','红萝卜','心里美萝卜','萝卜']}," +
                "{'name':'豆角','county':['毛豆角','绿龙豆角','豌豆','千千柳-','豆角']}," +
                "{'name':'黄瓜','county':['中农106','双丰黄瓜','碧玉黄瓜','早青2号','黄瓜']}," +
                "{'name':'土豆','county':['黑金刚土豆','大西洋','中薯系列','荷兰十五','土豆']}," +
                "{'name':'西红柿','county':['祥瑞','粉白利','樱桃西红柿','夏宝','欧盾','黑番茄','粉多纳','西红柿']}" +
                "]}," +

                "{'name':'粮油','city':[" +
                "{'name':'玉米','county':['吉祥一号','先玉335','甜玉米','糯玉米','玉米','江干']}," +
                "{'name':'小麦','county':['啤麦','永良','冬小麦','其他小麦']}," +
                "{'name':'大豆','county':['黄大豆','绿豆','红豆','黑豆']}," +
                "{'name':'稻米','county':['威优46','0538大米','稻糠','油糠']}" +
                "]}," +

                "{'name':'水果','city':[" +
                "{'name':'香蕉','county':['粉蕉','台湾旗山蕉','巴西香蕉','仙人蕉','香蕉']}," +
                "{'name':'西瓜','county':['花皮无籽','地雷瓜','8424西瓜','冠龙','西瓜']}," +
                "{'name':'甜瓜','county':['脆宝','早雪','花蕾','陕甜','白雪']}," +
                "{'name':'梨','county':['酥梨','雪花梨','长巴梨','皇冠梨','苹果梨']}," +
                "{'name':'甘蔗','county':['大灰种','黑皮甘蔗','糖蔗','黄皮甘蔗','香蕉']}," +
                "{'name':'毛桃','county':['黄桃','秦王桃','蟠桃','蜜桃','毛桃']}," +
                "{'name':'菠萝','county':['菠萝','台湾旗山蕉','巴西香蕉','仙人蕉','香蕉']}," +
                "{'name':'苹果','county':['红富士','秦冠','红星','青苹果','黄元帅','国光','红玉','苹果']}" +
                "]}," +

                "{'name':'采摘','city':[" +
                "{'name':'苹果','county':['红富士','秦冠','红星','青苹果','黄元帅','国光','红玉','苹果']}," +
                "{'name':'草莓','county':['大草莓','小草莓','草莓']}," +
                "{'name':'葡萄','county':['昌黎葡萄','葡萄','小鹅蛋葡萄']}," +
                "{'name':'樱桃','county':['卢龙樱桃','XX樱桃','樱桃']}" +
                "]}," +

                "{'name':'蛋类','city':[" +
                "{'name':'鸡蛋','county':['白鸡蛋','','胶州大白菜','青杂三号','白菜']}," +
                "{'name':'鸭蛋','county':['鸭蛋','大鸭蛋','小鸭蛋']}," +
                "{'name':'鹅蛋','county':['鹅蛋','大鹅蛋','小鹅蛋']}," +
                "{'name':'鹌鹑蛋','county':['鹌鹑蛋']}" +
                "]}," +

                "{'name':'菜地承包','city':[" +
                "{'name':'菜地承包','county':['海港区','卢龙','昌黎','青龙']}" +
                "]}," +

                "{'name':'农家院','city':[" +
                "{'name':'农家院','county':['海港区','','卢龙','昌黎','青龙']}]}" +
                "]}";
        return s;
    }
}
